app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      if @artist.nil?
        redirect_to artists_path
        flash[:alert] = 'Artist not found'
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all